# Алгоритм Хорспула
# - виконує пошук шаблону в тексті, порівнює символи справа наліво 
# та використовує таблицю зсувів, щоб пропускати частини тексту.



def build_shift_table(pattern):
    """
    Створення таблиці зсувів для алгоритму Хорспула.

    Таблиця зсувів показує:
    на скільки символів можна змістити шаблон,
    якщо під час порівняння знайдено невідповідність.

    Наприклад:
    для шаблону "ORCHESTRA"

    символ 'H' -- зсув 5
    символ 'T' -- зсув 2

    Якщо символу немає у таблиці,
    використовується стандартний зсув,
    що дорівнює довжині шаблону."""

    m = len(pattern)
    shift_table = {}

    # Спочатку задаємо стандартний зсув = довжина шаблону.
    # Це означає, що якщо символ не зустрічається всередині шаблону - шаблон можна змістити повністю.
    for char in pattern:
        shift_table[char] = m

    # Обчислюємо зсуви для всіх символів, окрім останнього.    
    # Для кожного символу обчислюємо відстань до кінця шаблону.
    # За формулою m - 1 - j
    # де:
    # m — довжина шаблону
    # j — індекс символу

    for j in range(m - 1):
        shift_table[pattern[j]] = m - 1 - j
        
        # Якщо символ зустрічається кілька разів, попереднє значення перезапишеться.
        # Це правильно, бо алгоритм має використовувати останнє входження символу.

    return shift_table


def print_alignment(text, pattern, start):
    """
    Виводить поточне вирівнювання шаблону під текстом.

    start — позиція, з якої починається шаблон у тексті.
    text — текст
    pattern — шаблон

    Функція допомагає побачити,
    як саме шаблон рухається по тексту.
    """

    print(text)
    print(" " * start + pattern)
    print()


def horspool_search(text, pattern):
    """
    Основна функція пошуку.

    Параметри:
    text — текст, у якому шукаємо
    pattern — шаблон, який потрібно знайти

    Функція повертає:
    позицію першого входження шаблону
    або -1, якщо шаблон не знайдено.
    """

    n = len(text)
    m = len(pattern)

    # Створюємо таблицю зсувів.
    shift_table = build_shift_table(pattern)

    # Виведення таблиці зсувів
    print("Таблиця зсувів:")
    for key, value in shift_table.items():
        print(f"'{key}' -- {value}")

    print("\nПочаток пошуку\n")

    i = m - 1
    # i — індекс у тексті, з яким вирівнюється останній символ шаблону.
    # Спочатку шаблон стоїть на самому початку, тому його останній символ має індекс m - 1.

    attempt = 1 # Лічильник спроб вирівнювання
    comparisons = 0 # Лічильник усіх порівнянь символів


    # Пошук триває, поки шаблон не вийде за межі тексту.
    while i < n: 

        print(f"Спроба {attempt}")
        print()

        # Обчислюємо позицію, з якої зараз починається шаблон.
        start = i - m + 1

        # Показуємо поточне вирівнювання
        print_alignment(text, pattern, start)
        
        # k — кількість успішних збігів.
        # Порівняння йде справа наліво.
        k = 0

        # Поки символи збігаються — рухаємось лівіше.
        while k < m and pattern[m - 1 - k] == text[i - k]:

            comparisons += 1

            print(
                f"Збіг: "
                f"{pattern[m - 1 - k]} == {text[i - k]}"
            )

            k += 1

        # Якщо k == m, значить збіглися всі символи шаблону.
        if k == m:

            position = i - m + 1

            print(f"\nШаблон знайдено на позиції {position}")
            print(f"Кількість порівнянь: {comparisons}")

            return position

        # Якщо є невідповідність
        else:

            comparisons += 1

            print(
                f"Невідповідність: "
                f"{pattern[m - 1 - k]} != {text[i - k]}"
            )

            # Символ тексту, який вирівняний із кінцем шаблону.
            # Саме по ньому визначається зсув.

            current_char = text[i]

            # Отримуємо зсув із таблиці.
            # Якщо символу немає — використовуємо стандартний зсув = m.
            shift = shift_table.get(current_char, m)

            print(
                f"Символ '{current_char}' "
                f"дає зсув {shift}."
            )

            print(f"Зсуваємо шаблон на {shift} позицій.\n")

            # Переміщуємо шаблон праворуч.
            i += shift

        attempt += 1
    # Якщо цикл завершився, шаблон у тексті не знайдено.
    print("Шаблон не знайдено")
    print(f"Кількість порівнянь: {comparisons}") # Скільки взагалі разів порівнювалися символи в перші спробі - 1, в 2-й - 1 і в 3-тій - 9 = 11.

    return -1


# Головна частина програми

# Тест у якому виконується пошук
text = "THE_SYMPHONY_ORCHESTRA_PERFORMED_WELL"
# Шаблон
pattern = "ORCHESTRA"

# Виклик алгоритму
result = horspool_search(text, pattern)

